Revit 2015 API
AreaReinforcement.GetCurveElementIds Method
 Retrieves the set of curves forming the boundary of the Area Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Autodesk Revit 2015. Call getBoundaryCurveIds instead.")]
public IList<ElementId> GetCurveElementIds()
Visual Basic
<ObsoleteAttribute("This method is obsolete in Autodesk Revit 2015. Call getBoundaryCurveIds instead.")> _
Public Function GetCurveElementIds As IList(Of ElementId)
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Autodesk Revit 2015. Call getBoundaryCurveIds instead.")]
public:
IList<ElementId^>^ GetCurveElementIds()
Return Value
 A collection of ElementIds of AreaReinforcementCurve elements.
Remarks
 Each ElementId in the collection is an Id of an Element of type AreaReinforcementCurve. Each element has a Curve property to retrieve the geometric curve, together with some Parameters allowing the developer to override the clear cover side, hook type, and hook direction of each layer of bars terminating at the curve.
See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace